{
  "name": "Osamodas' Whip",
  "roles": [
    {
      "title": "Minion",
      "description": "With a Gobgob by their side, Osamodas can capture up to five monsters that they can then summon in subsequent battles."
    },
    {
      "title": "Support",
      "description": "After having summoned their monsters, Osamodas have support effects which can also be used to help out an ally with whom they are linked."
    },
    {
      "title": "Damage",
      "description": "Osamodas can take on draconic form, changing their gameplay style for more offensive effects."
    }
  ],
  "description": {
    "keyWord": "Animal Summoners",
    "text": "They're fearless in the face of stampeding Minotorors, and the screech of Kwaks is music to their ears... Not even the howling of a hundred hungry Boowolves can make an Osamodas tremble! Their innate understanding of other creatures is so intense that a streak of animal magic runs through their veins too... which makes them exciting - if not outright dangerous - to be around!"
  },
  "difficulty": 3,
  "spells": [
    {
      "name": "Crobak",
      "description": "Crobak is a minor spell which is easy to cast and which can reach targets without a line of sight. Handy for hurting enemies from a safe hiding place.",
      "pa": "3",
      "pm": "0",
      "pw": "0",
      "range": "2 - 5",
      "lineOfSight": false,
      "modifiableRange": true,
      "lineOnly": false
    },
    {
      "name": "Scaraleaf Wing",
      "description": "A quick attack imitating the movements of a Scaraleaf's wings. It allows a summons to unlock and push back the target.",
      "pa": "2",
      "pm": "0",
      "pw": "0",
      "range": "1 - 3",
      "lineOfSight": false,
      "modifiableRange": true,
      "lineOnly": false
    },
    {
      "name": "Whip",
      "description": "A quick strike of the whip which increases the summons's critical hit skill.",
      "pa": "3",
      "pm": "0",
      "pw": "0",
      "range": "3 - 4",
      "lineOfSight": true,
      "modifiableRange": true,
      "lineOnly": false
    },
    {
      "name": "Bwork Sneakiness",
      "description": "A diversion technique that's well known by the Bworks. In Dragon Mode, the Osamodas spins his target around to hit it in the back. This spell also increases the summons's MP.",
      "pa": "3",
      "pm": "0",
      "pw": "0",
      "range": "2 - 4",
      "lineOfSight": false,
      "modifiableRange": true,
      "lineOnly": false
    },
    {
      "name": "Feather Tornado",
      "description": "A violent feather tornado which can be used to teleport one summons currently in close combat to a secure area whilst inflicting damage. A Dragon Mode Osamodas can also escape by switching places with his summons.",
      "pa": "4",
      "pm": "0",
      "pw": "1",
      "range": "3 - 4",
      "lineOfSight": true,
      "modifiableRange": true,
      "lineOnly": false
    },
    {
      "name": "Magpie",
      "description": "Magpie is used to damage enemies in an area while healing one's summon. It gives the summon a healing bonus. In Dragon Mode, it reduces the enemies' resistance to critical hits.",
      "pa": "3",
      "pm": "0",
      "pw": "0",
      "range": "2 - 3",
      "lineOfSight": true,
      "modifiableRange": true,
      "lineOnly": false
    },
    {
      "name": "Kwak's Cry",
      "description": "Imitating the shrill cry of the Kwak, the Osamodas attacks his enemies in a zone for a lesser cost. The summons gets a lock bonus.",
      "pa": "2",
      "pm": "0",
      "pw": "0",
      "range": "1 - 3",
      "lineOfSight": true,
      "modifiableRange": true,
      "lineOnly": false
    },
    {
      "name": "Boowolf Fury",
      "description": "Summoning the rage of a Boowolf, the Osamodas grants his summon a final damage bonus, making it a lot more dangerous. In Dragon mode, Boowolf Rage also increases the damage dealt by a summons to hit enemies.",
      "pa": "4",
      "pm": "0",
      "pw": "0",
      "range": "2 - 4",
      "lineOfSight": true,
      "modifiableRange": true,
      "lineOnly": false
    },
    {
      "name": "Croak",
      "description": "An animal croak which motivates the summons by giving it an AP bonus.",
      "pa": "5",
      "pm": "0",
      "pw": "0",
      "range": "1 - 3",
      "lineOfSight": false,
      "modifiableRange": true,
      "lineOnly": true
    },
    {
      "name": "Sramva's Slash",
      "description": "Sramva's Slash is an aggressive technique which consists of jumping in the fray to deal damage to enemies. Besides simply throwing it at an enemy, the Osamodas has found a way to use this technique to send his summons into a scrap with an enemy and deal them area damage. In Dragon Mode, the Osamodas can switch positions with his summon if it is in close combat with an enemy, to deal even more damage.",
      "pa": "6",
      "pm": "0",
      "pw": "1",
      "range": "1 - 4",
      "lineOfSight": false,
      "modifiableRange": true,
      "lineOnly": true
    },
    {
      "name": "Crocodyl Spirit",
      "description": "Marked with the Crocodyl's Spirit, the Osamodas  heals his summons and gives it a dodge bonus. In Dragon mode, the Crocodyls' offensive spirit allows it to reduce its opponent's resistance.",
      "pa": "2",
      "pm": "0",
      "pw": "0",
      "range": "1 - 3",
      "lineOfSight": true,
      "modifiableRange": true,
      "lineOnly": false
    },
    {
      "name": "Cwabstix Pincer",
      "description": "Cwabstix Shells are known to be hard to pierce. This technique gives the Summons armor at the start of each of its turns. In Dragon mode, it also takes away MP from enemies close to the Osamodas.",
      "pa": "4",
      "pm": "0",
      "pw": "0",
      "range": "1 - 4",
      "lineOfSight": false,
      "modifiableRange": true,
      "lineOnly": true
    },
    {
      "name": "Taur Strength",
      "description": "A brutal hit, just like the Taurs would do. The Summons gains increased resistance.",
      "pa": "5",
      "pm": "0",
      "pw": "0",
      "range": "1 - 3",
      "lineOfSight": true,
      "modifiableRange": true,
      "lineOnly": false
    },
    {
      "name": "Drheller's Trail",
      "description": "The Animal Resilience granted by this spell increases the efficiency of healing received by the summons. In Dragon mode, the Osamodas uses his summons located at the other end of the trail to create a seismic wave and deal more damage.",
      "pa": "4",
      "pm": "0",
      "pw": "0",
      "range": "2 - 4",
      "lineOfSight": true,
      "modifiableRange": true,
      "lineOnly": false
    },
    {
      "name": "Crackler Punch",
      "description": "Simulating a powerful Crackler punch, the Osamodas deals damage in a large area. When in Dragon mode, a similar less powerful blow is carried out by his summons.",
      "pa": "5",
      "pm": "0",
      "pw": "1",
      "range": "3 - 4",
      "lineOfSight": true,
      "modifiableRange": false,
      "lineOnly": false
    }
  ]
}